# 1.Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

# Создание нескольких переменных
User = 'Сергей'
Password = '123456'

# вывод созданных переменных на экран
print(User)
print(Password)

# запрос у пользователя нескольких чисел:
Number = int(input('Введите пароль: '))

# запрос у пользователя нескольких строк:
Name = input('Введите имя: ')

# вывод сохраненных данных:
print("Вы ввели пароль:", Number)
print("Вы ввели имя:", Name)